---
kind: property
id: P:Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution.TiltAngle
source: html/59aff487-6a7c-dcf2-4d7a-bfe370a449d9.htm
---
# Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution.TiltAngle Property

The tilt angle.

## Syntax (C#)
```csharp
public double TiltAngle { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The angle is not valid because it is not between -180.0 and 180.0.